# New Section

# Summer Olympics Data Analysis Assignment

In [170]:
import pandas as pd
df = pd.read_csv("summer.csv")

In [172]:
df.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

### 1. In how many cities Summer Olympics is held so far?

In [173]:
len(df['City'].unique())

22

### 2. Which sport is having most number of Gold Medals so far? (Top 5)

In [174]:

data=[]
data=df[df['Medal']=='Gold']
meta=[]
for sport in data['Sport'].unique():
  meta.append([sport,len(data[data['Sport']==sport])])
  
meta=pd.DataFrame(meta,columns=['Sport','Gold Medals'])
meta.sort_values(by='Gold Medals',ascending=False).head()
# meta.plot(x='Sport',y='Gold Medals')

         Sport  Gold Medals
0     Aquatics         1421
1    Athletics         1215
17      Rowing          890
4   Gymnastics          820
3      Fencing          552

### 3. Which sport is having most number of medals so far? (Top 5)

In [175]:
reta=[]
for sport in df['Sport'].unique():
  reta.append([sport,len(df[df['Sport']==sport])])
  
reta=pd.DataFrame(reta,columns=['Sport','Medals'])
reta.sort_values(by='Medals',ascending=False).head()

         Sport  Medals
0     Aquatics    4170
1    Athletics    3638
17      Rowing    2667
4   Gymnastics    2307
3      Fencing    1613

### 4. Which player has won most number of medals? (Top 5)

In [177]:
neta=[]
for Athlete in df['Athlete'].unique():
  neta.append([Athlete,len(df[df['Athlete']==Athlete])])
  
neta=pd.DataFrame(neta,columns=['Athlete','Medals'])
neta.sort_values(by='Medals',ascending=False).head()

                    Athlete  Medals
18640       PHELPS, Michael      22
7197       LATYNINA, Larisa      18
9948     ANDRIANOV, Nikolay      15
6591           ONO, Takashi      13
5103   MANGIAROTTI, Edoardo      13

### 5. Which player has won most number Gold Medals of medals? (Top 5)

In [176]:
nata=[]
nata=df[df['Medal']=='Gold']
xeta=[]
for Athlete in nata['Athlete'].unique():
  xeta.append([Athlete,len(nata[nata['Athlete']==Athlete])])
  
xeta=pd.DataFrame(xeta,columns=['Athlete','Gold Medals'])
xeta.sort_values(by='Gold Medals',ascending=False).head()

               Athlete  Gold Medals
6851   PHELPS, Michael           18
3320       SPITZ, Mark            9
2714  LATYNINA, Larisa            9
4630       LEWIS, Carl            9
907       NURMI, Paavo            9

### 6. In which year India won first Gold Medal in Summer Olympics?

In [178]:
len(df[df['City']=="India"])

0

### 7. Which event is most popular in terms on number of players? (Top 5)

In [179]:
niba=[]
for events in df['Event'].unique():
  niba.append([events,len(df[df['Event']==events])])
niba=pd.DataFrame(niba,columns=['Event','players'])
niba.sort_values(by='players',ascending=False).head()

                Event  players
80           Football     1497
176            Hockey     1422
138  Team Competition     1147
327        Basketball     1012
337          Handball      973

### 8. Which sport is having most female Gold Medalists? (Top 5)

In [180]:
rata=[]
rata=df[df['Gender']=='Women']
rata=rata[rata['Medal']=='Gold']
eta=[]
for Sports in rata['Sport'].unique():
  eta.append([Sports,len(rata[rata['Sport']==Sports])])
  
eta=pd.DataFrame(eta,columns=['Sport','Womens'])
eta.sort_values(by='Womens',ascending=False).head()

         Sport  Womens
4     Aquatics     589
7    Athletics     389
8   Gymnastics     268
14      Rowing     217
11  Volleyball     166